Revit 2027 API
ParameterTypeId.FbxLightPhotometrics Property
 "Light Source Definition"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FbxLightPhotometrics { get; }
Public Shared ReadOnly Property FbxLightPhotometrics As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FbxLightPhotometrics {
	ForgeTypeId^ get ();
}
static member FbxLightPhotometrics : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace